In [1]:
import numpy as np
import pandas as pd

In [3]:
df_time=pd.read_csv("C:/Users/DSingh/Desktop/100DaysofML/datasets/messages.csv")
df_date=pd.read_csv("C:/Users/DSingh/Desktop/100DaysofML/datasets/orders.csv")

In [5]:
df_date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [7]:
df_time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [8]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [9]:
df_date['date']=pd.to_datetime(df_date['date'])

In [11]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [12]:
df_date['date_year']=df_date['date'].dt.year

In [14]:
df_date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

In [19]:
df_date['date_month']=df_date['date'].dt.month
df_date['date_month_name']=df_date['date'].dt.month_name()
df_date['date_day']=df_date['date'].dt.day
df_date['date_day_of_week']=df_date['date'].dt.dayofweek

In [20]:
df_date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_day_of_week
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [21]:
df_date['date_day_name']=df_date['date'].dt.day_name()

In [23]:

df_date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_day_of_week,date_day_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [25]:
df_date['day_is_weekend']=np.where(df_date['date_day_name'].isin(['Saturday','Sunday']),1,0 )

In [27]:
df_date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_day_of_week,date_day_name,day_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

## for week we use 
# .dt.week
## for quarter we use 
# .dt.quarter

In [28]:
## for time elapsed (time gap between two dates)
import datetime

today=datetime.datetime.today()

In [29]:
today-df_date['date']

0     2247 days 22:36:34.577454
1     2729 days 22:36:34.577454
2     2660 days 22:36:34.577454
3     2362 days 22:36:34.577454
4     2585 days 22:36:34.577454
                 ...
995   2675 days 22:36:34.577454
996   2616 days 22:36:34.577454
997   2464 days 22:36:34.577454
998   2529 days 22:36:34.577454
999   2303 days 22:36:34.577454
Name: date, Length: 1000, dtype: timedelta64[ns]

In [32]:
(today-df_date['date']).dt.days

0      2247
1      2729
2      2660
3      2362
4      2585
       ...
995    2675
996    2616
997    2464
998    2529
999    2303
Name: date, Length: 1000, dtype: int64

In [37]:
## Month passed
#np.round((today-df_date['date'])/np.timedelta64(1,'M'),0)

months_diff = (today.year - df_date['date'].dt.year) * 12 + (today.month - df_date['date'].dt.month)
months_diff

0      74
1      90
2      88
3      78
4      85
       ..
995    88
996    86
997    81
998    83
999    76
Name: date, Length: 1000, dtype: int32

In [40]:
df_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [41]:
df_time['date']=pd.to_datetime(df_time['date'])

In [42]:
df_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [45]:
df_time['hour']=df_time['date'].dt.hour
df_time['min']=df_time['date'].dt.minute

df_time['sec']=df_time['date'].dt.second

In [46]:
df_time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [47]:
df_time['time']=df_time['date'].dt.time

In [48]:
df_time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [50]:
today-df_time['date']

0     4433 days 21:46:34.577454
1     4297 days 22:56:34.577454
2     4783 days 22:15:34.577454
3     4085 days 22:05:34.577454
4     4482 days 23:25:34.577454
                 ...
995   5072 days 21:46:34.577454
996   4393 days 23:22:34.577454
997   4858 days 22:59:34.577454
998   4974 days 23:02:34.577454
999   4246 days 23:11:34.577454
Name: date, Length: 1000, dtype: timedelta64[ns]

In [ ]:
## time difference in seconds 
(today-df_time['date'])/np.timedelta64(1,'s')

0      3.830896e+08
1      3.713434e+08
2      4.133313e+08
3      3.530235e+08
4      3.873291e+08
           ...
995    4.382992e+08
996    3.796394e+08
997    4.198140e+08
998    4.298366e+08
999    3.669379e+08
Name: date, Length: 1000, dtype: float64

In [52]:
# time difference in minutes
(today-df_time['date'])/np.timedelta64(1,'m')

0      6.384827e+06
1      6.189057e+06
2      6.888856e+06
3      5.883726e+06
4      6.455486e+06
           ...
995    7.304987e+06
996    6.327323e+06
997    6.996900e+06
998    7.163943e+06
999    6.115632e+06
Name: date, Length: 1000, dtype: float64